---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidNumwiresSinglephase
source: html/f11c5862-7920-3eef-dc71-e25a00a0b8f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidNumwiresSinglephase Property

Invalid number of wires for single phase, only 2 and 3 are valid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidNumwiresSinglephase { get; }
```